serving/results/llama_qwen_ds/logs/benchmarks/sandhi__models_qwen2_5_coder_7b_instruct.log

==================================
Running benchmarks (sandhi / qwen)
==================================

==================================
Target: qwen
Port: 12306
Model: /models/Qwen2.5-Coder-7B-Instruct
==================================
RPS=7
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:14:25][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:14:26 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:14:30][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:14:30][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:14:32.980000 28029 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:14:32.980000 28029 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:14:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:14:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:14:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:14:33][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c33d5b30680>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=7.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:14:34 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 580:04:58 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 7.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:39<00:00,  6.26it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           7.00      
Benchmark duration (s):                  39.96     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              6.26      
Output token throughput (tok/s):         5629.95   
Peak output token throughput (tok/s):    7607.00   
Peak concurrent requests:                51.00     
Total Token throughput (tok/s):          6254.98   
---------------Time to First Token----------------
Mean TTFT (ms):                          24.19     
Median TTFT (ms):                        24.30     
P95 TTFT (ms):                           30.11     
P99 TTFT (ms):                           31.65     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.22      
Median TPOT (ms):                        5.26      
P95 TPOT (ms):                           5.73      
P99 TPOT (ms):                           5.76      
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.22      
Median ITL (ms):                         5.19      
P95 ITL (ms):                            6.17      
P99 ITL (ms):                            7.02      
==================================================
RPS=10
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:15:21][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:15:22 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:15:26][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:15:26][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:15:28.958000 28550 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:15:28.958000 28550 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:15:29][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:15:29][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:15:29][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:15:29][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7303b9d30680>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:15:30 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 540:31:43 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:29<00:00,  8.40it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  29.77     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              8.40      
Output token throughput (tok/s):         7557.96   
Peak output token throughput (tok/s):    9969.00   
Peak concurrent requests:                77.00     
Total Token throughput (tok/s):          8397.03   
---------------Time to First Token----------------
Mean TTFT (ms):                          27.26     
Median TTFT (ms):                        27.15     
P95 TTFT (ms):                           34.93     
P99 TTFT (ms):                           58.05     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.21      
Median TPOT (ms):                        6.24      
P95 TPOT (ms):                           6.99      
P99 TPOT (ms):                           7.05      
---------------Inter-token Latency----------------
Mean ITL (ms):                           6.21      
Median ITL (ms):                         6.16      
P95 ITL (ms):                            7.53      
P99 ITL (ms):                            8.72      
==================================================
RPS=15
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:16:07][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:16:08 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:16:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:16:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:16:14.557000 28942 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:16:14.557000 28942 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:16:15][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:16:15][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:16:15][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:16:15][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b11a43245e0>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=15.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:16:15 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 525:02:23 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 15.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:23<00:00, 10.75it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           15.00     
Benchmark duration (s):                  23.25     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              10.75     
Output token throughput (tok/s):         9678.68   
Peak output token throughput (tok/s):    13350.00  
Peak concurrent requests:                131.00    
Total Token throughput (tok/s):          10753.19  
---------------Time to First Token----------------
Mean TTFT (ms):                          70.07     
Median TTFT (ms):                        31.55     
P95 TTFT (ms):                           383.69    
P99 TTFT (ms):                           740.67    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          8.28      
Median TPOT (ms):                        8.21      
P95 TPOT (ms):                           9.74      
P99 TPOT (ms):                           9.75      
---------------Inter-token Latency----------------
Mean ITL (ms):                           8.28      
Median ITL (ms):                         7.85      
P95 ITL (ms):                            9.96      
P99 ITL (ms):                            12.10     
==================================================